notes/talks/multidispatch_vs_case/compare_multi_and_case.org
* raku case vs multidispatch                                              f
** rough comparison
*** case
**** clear flow of execution: sequence of comparisons all in one place (running a gauntlet)
**** "default" means the catch-all, the alternative if no other cases match
**** flexible: good for any sort of comparison, e.g. pattern matches
*** multi
**** best for 
***** checking types
***** particular fixed values
**** orders cases ~by "specificity", not lexically 
***** in the case of subsets, falls back to order of definition
****** subsets are grouped by the type they're based on
****** BUT they don't behave like two multis with same type
******* uses the order of definition for subsets based on same type 
**** code that handles various types can be scattered, defined in different places (common with OOP)
**** there's an "is default" trait available to break ties in type specificity
***** not quite the same as the given/when "default"
**** has other features: e.g. distinction by arity
***** need to review what named arguments do



